Revit 2026 API

# GlazingCommonTintColor Property

---

The property labeled "Tint Color" from the "Glazing" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string CommonTintColor { get; }
```
```vb
Public Shared ReadOnly Property CommonTintColor As String
	Get
```
```cpp
public:
static property String^ CommonTintColor {
	String^ get ();
}
```
```fsharp
static member CommonTintColor : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d".

#### Reference

Glazing Class

Autodesk.Revit.DB.Visual Namespace